Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN, BLUE.tmx
Source language: id
Languages: en

source: bunda ngapain kok jongkok gitu?
en: why are you crouching here?

source: #harap tidak mencontoh
en: #disclaimer: piracy is strictly prohibited

source: di depan rame, ada apa ya jun?
en: i heard a commotion, what was it about?

source: Segala yang terjadi di hidupku terlintas dipikiranku, saat itulah aku mengingatmu
en: the events of my life were like a movie playing in my head. that’s when I thought about you.

source: si juni baru masuk di kelasku
en: juni has just entered my classroom.

source: MANA JARIMU
en: gimme your pinky.

source: aku hanya kadang-kadang melihat sosoknya dari kejauhan
en: ...I only saw him from afar every once in a while.

source: sakit..
en: it hurts...

source: HAH MANA...
en: huh? where?

source: haah kalian tuh gausah banyak tingkah bisa ngga sih??
en: can't you guys stop acting like idiots?

source: elis aku akan ke situ
en: I’m coming.

source: oh ya ? kok covernya beda!
en: oh yeah? but the cover looks different.

source: mala dan yoyo,
en: mala and yoyo,

source: kamu memang mau lompat kan?
en: you intended to jump, didn't you?

source: kenapa kamu bisa tahu?
en: how did you know about it?

source: engga.
en: no.

source: BUK!
en: pow

source: permisi-
en: excuse me.

source: takut ketemu poling!
en: I don’t wanna run into it!

source: mereknya rodens, frame kacanya besar
en: the brand was rodens, with large frame.

source: kalau ada masalah bilang saja!
en: if you got problems with me, just say so!

source: katanya kamu kesurupan dan ngga sadar-sadar
en: they said you were possessed and kept passing out.

source: apa ada lagi setan seperti dia? haha
en: are there any other ghosts like him?

source: t-t-tantee!!
en: Auntie!

source: juni.. kok diem?
en: juni, why are you so quiet?

source: dia kuliah jurusan hukum dan berhasil menyelesaikan kuliahnya tepat waktu dan memuaskan
en: he went to law school and completed his study on time and graduated with honors.

source: kamu ngga lihat mobilnya melaju cepat?
en: didn’t you see the car was speeding?

source: kalo miskin tahu diri kenapa!
en: don’t buy them if you’re broke!

source: aku jadi banyak memikirkan perkataannya dulu
en: then I recalled the things he said.

source: aku punya trauma dengan hantu itu
en: ...I had a horrible experience with that ghost.

source: yok kampung rambutan! kampung rambutan!
en: heading to kampung rambutan here!

source: ku pikir dia hanya hantu gentayangan biasa yang lupa akan dirinya
en: I thought he was just a wandering ghost who had forgotten who he was.

source: apa lagi?
en: for what?

source: dan akhirnya.. untuk beberapa hari bu elis jadi suka nginep di rumahku
en: for thenext few days, ms. elis ended up staying over at my house.

source: Kamu tahu kenapa Bu Elis mau susah-susah mengurusmu sampai datang ke rumah, padahal gajinya sebagai guru honorer tidak banyak?
en: despite her low salary as an honorary instructor, ms. elis took the time and effort to care after you and even visit you at your house. do you know why?

source: mungkin mba bisa pilih beberapa merk ini mba, kualitasnya ngga kalah-
en: but we do sell other brands, the quality is just as good, you can choose--

source: aku berani sendiri kok...
en: I’m not afraid at all.

source: bebeng pinjem motor ya!
en: bebeng, i’m using your motorbike!

source: gara-gara terlalu giat belajar dia jadi jarang makan, itulah alasannya kenapa dia akhirnya kurus
en: he rarely ate because he studied so hard. That's why he became so thin.

source: yang sudah menganggapku seperti anak sendiri, bu cicih, ibunya bebeng
en: ms. cicih, bebeng’s mom, cared for me as if I were her own.

source: itu pasti jim..
en: I’m sure it was jimmy.

source: pernah anak kota
en: former city girl.

source: setelah lulus dia bekerja di berbagai tempat, dari pabrik, perkantoran...
en: he worked various jobs after graduating, from factories to offices.

source: udah gapapa..
en: It’s okay. I got you.

source: eh beng, toko kaset dulu
en: let’s stop by the record shop first.

source: ngga, aku di luar aja
en: no, I’ll be waiting here.

source: jim kalo rewel mulu ayah palu nih?
en: stop whining, or it will take much longer.

source: lari lari lari!_x0003_terbang dan berlari-i!
en: run, bebeng, run!

source: *lembaga bantuan hukum
en: *legal aid institute (LAI), or in bahasa indonesia, lembaga bantuan hukum (LBH), is indonesia's first legal aid non-government organization.

source: sengaja?
en: on purpose?

source: kenapa nama itu lagi..?
en: why that name again?

source: mereka udah tau..?
en: they already knew?

source: hidupku tetap berjalan seperti biasa
en: my daily routine remained unchanged.

source: album sam yang waktu itu ngga boleh kulihat..kan?
en: ...samuel's photo album that he refused to let me see?

source: ada gaya lain yang ngga jijik ngga?
en: can you strike a less disgusting pose?

source: sabar, sabar
en: easy, easy.

source: beng nanti pinjem duit ya?
en: bebeng, will you lend me some money?

source: scream 1 kan kita udah nonton
en: scream 1? didn’t we already watch this?

source: Tapi kalau ini kesempatan terakhirku melihat dunia
en: but if that was my last chance to see the world...

source: hah sial!
en: ah, damn!

source: apa kamu lihat sesuatu..?
en: did you see something here?

source: kamu marah padaku?
en: are you angry with me?

source: lalu suatu hari..
en: and one day...

source: aku menemukanmu
en: I found you...

source: ...aku sendiri
en: it was myself.

source: karena kita miskin
en: it’s because we’re broke.

source: apa kamu pernah..
en: did you perhaps...

source: wushhh
en: whoosh

source: dari awal kamu mau mati kan?
en: you wished to die in the first place, right?

source: huwaaa!!
en: WAAH!

source: serem..
en: so creepy...

source: ada urusan apa dia?
en: what brings her here?

source: silahkan bu!
en: welcome!

source: dua bocah yang hobinya smackdown tiap ketemu.. ternyata malah jodoh...
en: two kids who used to get into fights whenever they met now turned into lovers.

source: apa karna bbm naik?
en: is it because gas prices soared high?

source: di rumah sendiri deh
en: and I’ll be all alone.

source: ..untuk mencegahmu?
en: ...to prevent you from doing such things?

source: jujur aku jadi sedih
en: but honestly, it makes me sad.

source: pak kacamata ini..
en: Sir, that one...

source: kami pikir mungkin saja penjual kacamatanya ingat dengan pembelinya
en: we hoped that the seller of the glasses would recall who bought them.

source: kamu takut ?
en: are you scared?

source: mana jim..
en: where’s jimmy?

source: kamu kan hantu, emang bisa jatuh cinta?
en: you’re a ghost. how can a ghost fall in love?

source: sebenarnya kenapa?
en: ...is going on with you?

source: oh! apa kamu tahu dari caca?
en: oh! did caca tell you about it?

source: Dulu kamu satu-satunya cewek yang main sama cowok hahaha
en: you were the only girl who used to hang out with the boys, hahaha.

source: ADUH..
en: ouch...

source: mengulang semuanya dari awal?
en: ...just have to start from square one?

source: pantesan dia tahu masa laluku!
en: no wonder he knew about my past!

source: gimana kalau aku melupakanmu ?!!
en: what do I do if I forget you?!

source: assalamualaikum...
en: hello, everyone.

source: aku ngga takut, aku cuma kaget
en: I wasn’t scared. I was just startled.

source: kalau malam aku melindungimu
en: I look out for you every night.

source: hah jam berapa emang?
en: huh? what time is it?

source: di jakarta kami tinggal di sebuah kos-kosan murah di perkampungan
en: we lived in a cheap boarding house on the outskirts of jakarta.

source: halah yuan
en: you know how she is.

source: pats
en: zap

source: bunda bisa main itu?
en: can you play it?

source: sampai jumpa!
en: see you!

source: ya bagus
en: well, it is.

source: kenapa aku bohong?
en: why did I lie to him?

source: ikat rambutmu kalau olahraga
en: when you work out, tie your hair back.

source: dan semakin aku merasa gila...
en: the more crazy I’ve felt...

source: cling
en: sparkle

source: CK
en: tsk.

source: apa karena orang-orang di kampung lebih baik?
en: is it because the folks in the village are friendly?

source: semakin aku menyadari keberadaan jim...
en: the more I became aware of Jimmy's presence...

source: setelah kepergian jim..
en: After Jimmy disappeared...

source: jangan sampe kena tegur guru terus...
en: stop making the teacher angry at you.

source: jadi walau prosesnya lama dan melelahkan, dia tetap terlihat selalu menikmatinya
en: so, no matter how arduous and long the process was, he’d always enjoyed it.

source: kalian berantem?
en: did you guys fight?

source: ini..
en: is this...

source: selamat ya yuan dan bebeng!
en: congratulations, yuan and bebeng!

source: i-iya..
en: y-yeah...

source: emang engga! akk!
en: I did not! ouch!

source: itu.. pintuku..
en: it’s my door...

source: capek dikit haha
en: only a bit, haha.

source: kalau di sekolah ngga boleh kribo
en: you can’t have messy hair style in school.

source: toko 2
en: store 2

source: jim?
en: jimmy?

source: hiiih!
en: hey!

source: nanti kelihatannya jelek
en: it’ll look bad, you know?

source: maaf bu ganggu malem-malem benarkah ini rumahnya da-
en: I apologize for calling you this late. is this damar’s--

source: tapi aku seneng kok, radi sudah seperti adikku sendiri
en: but i don’t mind, because radi is like a brother to me.

source: *rantai putus*
en: *snapped chain*

source: mending kalian cepetan nikah sebelum diciduk warga
en: can’t you just get married before people start rumors?

source: HAH MASA SIH?
en: huh, really?

source: dia mundur setahun sampai akhirnya dapat kuliah, dia mengambil jurusan mesin
en: ...he had to wait another year before being accepted into mechanical engineering.

source: aku pakai uang itu untuk pergi ke jakarta mengikuti bebeng dan sam yang ingin melanjutkan kuliahnya di sana
en: bebeng and samuel were studying in Jakarta at the time, so I used the money to visit them.

source: maafin aku
en: I’m sorry.

source: buat apa keberadaanku setengah tahun ini?
en: ...the six months I spent here would be all in vain.

source: tunggu
en: wait

source: ooh titanic, ini lagi rame tau
en: titanic has been a real buzz lately.

source: n-nginep?
en: h-here?

source: dari damar
en: it was damar.

source: HAAH BISA MAIN GA SIH?
en: you're terrible at video games.

source: yah pokoknya dia suka merepotkan dirinya sendiri
en: well, he has a habit of causing difficulties for himself.

source: jam besuknya udah lewatt!!
en: is the visiting hour over?

source: Aku jadi tidak ingin menyebut namaku lagi
en: so I decided to stop saying my name.

source: atau gimana ya tante..?
en: or could you please explain?

source: bundaa!!
en: mom!

source: maafin aku juni
en: please forgive me, juni.

source: aku hanya bisa bertanya seperti itu dalam hati
en: those were the questions that had been bothering me.

source: Tapi kali ini lampu rumahmu akhirnya menyala,
en: however, that day, the lights in your house were on.

source: yaudah besok-besok lagi aja
en: we can come back again next time.

source: Aku berbohong kalau aku tidak ingat apa-apa, dan membiarkan kalian melakukan hal-hal yang sebenarnya dulu kita lakukan
en: I lied about not remembering everything, and letting you all doing the things that we used to do in the past.

source: blur demi kebaikan bangsa
en: it’s blurred for the greater good.

source: aku menikmati segala ke’biasa’an itu
en: ...I enjoyed this ordinary so much.

source: kertas apa ini-
en: what is this?

source: urusan hidup seseorang selesai setelah ia meninggal..
en: well, when you die, your life comes to an end.

source: beberapa hari ini di kampungku sedang beredar gosip pocong gentayangan
en: there had been a rumor about a pocong haunting around in the last few days.

source: karena dia ngga mau ninggalin kamu sendirian
en: because he didn’t wanna leave you alone.

source: caca! bu elis!!
en: caca! ms. elis!

source: bantuin bego!
en: go help her, idiot!

source: kalau malem bisa lihat pemandangan lampu-lampu gedung tinggi
en: at night, we enjoy the lights of the city's buildings.

source: aduduh!
en: ouch!

source: nikah kalian bohongan?
en: did you both really marry?

source: bebeng adalah orang yang paling gila diantara kami, tahu kenapa?
en: well, bebeng is the craziest of us all. you know why?

source: untung ga jatuh ke sungai..
en: luckily it didn’t drop into the river.

source: aduh warna itu juga bagus!
en: that color also looks good on you!

source: bunda!!
en: mom!

source: *MATI LAMPU
en: *blackout

source: Ternyata itu juga yang dipikirkan teman-temanku, Bebeng dan Sam
en: I also realized that bebeng and samuel have the same thoughts.

source: apa... justru karena ada jim hantu-hantu itu dulu berkurang?
en: did jimmy’s presence make me saw them less often?

source: setiap hari aku pergi ke sekolah.. dan belajar sebisanya
en: I went to school and studied every day.

source: aduh maap
en: oh, sorry.

source: pft!
en: pfft!

source: kamu belum selesai juga periksa ulangannya? mau kubantuin?
en: you’re note done yet reviewing the tests? want me to help?

source: cita-citaku apa ya..
en: what are my goals?

source: engga kok
en: I won’t.

source: aku ngga enak mengungkit masa lalu
en: I didn't want to reopen your old wounds

source: loh...
en: huh...

source: aku tidur di sini
en: I’ll sleep here.

source: ini lain cerita!!
en: except for this one!

source: makanya kamu mau lompat?
en: was that why you wished to jump?

source: dari tadi kek kalo bisa!!
en: you should’ve said so!

source: swishh
en: swish

source: kemarin cowoknya nembak ceweknya kan?
en: he's finally asked her out, right?

source: jim sialan!!
en: damn you, jimmy!

source: juventus kalah...
en: juventus lost.

source: ngomong-ngomong kamu lagi ngapain?
en: by the way, what are you up to?

source: juni kamu kan cantik, coba mulai cari kerja yang butuh itu..?
en: you're pretty, juni. so, how about a job that requires looks?

source: lalu kamu ngga pernah masuk sekolah lagi
en: after that, you never showed up again at school.

source: bebeng penakut! lalala
en: bebeng is a coward! nanana~

source: langsung minggat
en: at once

source: oh gitu.. iya gapapa
en: I see. it’s okay.

source: kenapa sih..
en: just what...

source: dia menulisnya sendiri
en: he wrote them himself.

source: lihat! itu persis damar!
en: it looks similar to damar!

source: jim...
en: jimmy...

source: lagu hits masa kini!
en: ...it was a hit!

source: minggir!!
en: step aside!

source: bebeng akhirnya membawa yuan ke jakarta karena sudah jadi tanggung jawabnya
en: now that yuan became his lifelong partner, bebeng brought her to jakarta.

source: juni kok sendiri? si kecil mana?
en: juni, where’s your child?

source: ternyata bebeng menghilang untuk mencari yuan setelah mendengar kabar bahwa ia akan dijodohin ke seorang juragan sebagai istri ketiganya
en: it turned out that bebeng, whom we thought had gone missing, went to find Yuan after learning that she would be married off to a rich old guy as his third wife.

source: iya capeek
en: yeah, so tired!

source: jesjessjessjess
en: choo choo

source: awas roboh!
en: the booth will fall down!

source: selamat datang!
en: welcome!

source: aaaahhh!!
en: no fair!

source: EP.53 -BIRU (END)
en: ep. 53 - blue (season finale)

source: tapi akhirnya dia bisa menyelesaikan kuliahnya di tahun ke tujuh
en: he eventually finished his study on his seventh year in uni.

source: ah maaf bu, salah nomer ternyata
en: oh, sorry. I’ve dialed the wrong number.

source: iya, semua orang di sekolah ngomongin itu
en: everyone at school has been talking about it.

source: hari ini libur jadi kami pergi ke kota untuk nonton bioskop
en: it was a holiday, so we went to a cinema in the city.

source: hmm lumayan
en: a bit.

source: nggak
en: no.

source: Elis buka pintunya!
en: elis, open the door!

source: bukan ya?
en: oh, it’s not?

source: ampun
en: oh my

source: dan berharap aku akan mengerti dengan sendirinya
en: I had hoped that I’d know the answers eventually.

source: heh dateng juga!
en: there you are, finally!

source: ssshh
en: whoosh

source: kok..
en: was...

source: sruk
en: fwip

source: jadi pekerjaan pertamaku adalah spg rokok
en: my first job was as sales promotion girl for cigarette

source: cring
en: ka-ching

source: katanya kamu ngga akan maksa-maksa orang kayak juragan itu!
en: you said you won’t force her like that old man!

source: haduh berisik ah
en: gosh, stop whining.

source: ah.. engga sih cuma...
en: not really, it’s just...

source: itu surat untukku, dan sisanya untuk kalian
en: one letter is for me, and the rest are for you guys.

source: jreng jreng jrengg!!
en: strum strum strum

source: nonton! nonton!
en: yeah, I did!

source: oh iya inget
en: ah, I remember.

source: mak comblang
en: the matchmakers

source: warnanya silver..
en: it’s silver.

source: kenapa..
en: why...

source: a-aku pernah bohong padamu jim
en: I lied to you the other day, jimmy.

source: yang itu.. kok mirip..
en: those glasses look similar.

source: ha-hantu itu..
en: th-the ghost...

source: apa dia masih di ICU?
en: is he still in the ICU?

source: ... ngga jadi deh bi
en: never mind, aunty.

source: bisa minta tolong ngga?
en: can you do me a favor?

source: AAAH!!
en: aah!!

source: udah ditutup ya..?
en: did she hang up the phone?

source: aku.. temanmu
en: I’m... your friend.

source: tadi sih lagi pergi ke rumah pak rw sama suamiku, kok belum pulang ya?
en: he and his dad headed to the chief’s house. but what took them so long?

source: radi sudah ibu bilang, kalo salim pelan-pelan
en: radi, be gentle when you shake hands with someone.

source: kamu sudah janji tidak akan pergi sampai aku menikah!
en: you promised to always be with me until I got married.

source: entah perasaanku saja atau memang benar
en: ...whether it was just me or if it was true...

source: mungkin saja ada seseorang yang mengingat jim disini
en: maybe there would be someone who remember jimmy.

source: hei jim.. kenapa jadi serius begini sih?
en: hey, jimmy, why so serious?

source: ini bahkan belum sebulan sejak hari itu!
en: it hasn’t even been a month since that day!

source: apa kamu benar-benar pergi?
en: did you really go away?

source: kami menonton film titanic yang sedang booming saat itu
en: we watched titanic which was a hot topic that time.

source: jim aku mau ganti baju, jangan masuk!
en: I need to change clothes. don’t come in!

source: mana kutahu?!!
en: how would I know?!

source: maaf ya jadi lama
en: sorry for the long wait.

source: sebentar juni..
en: hold on, juni.

source: dia ngga lupa!
en: he didn’t forget anything!

source: gimana kalo taro sini?
en: should we just leave it here?

source: kapan datengnya?
en: when did you guys come?

source: jangan pergi kemana-mana..
en: ...you won’t go away.

source: Tapi aku selalu mengurungkan niatku setelah melihat ibuku menangis
en: however, I changed my mind after seeing my mom in tears.

source: karena dia belum meninggal, dia... arwah orang koma..?
en: because he’s in a comma, so he’s not dead yet?

source: oh yang itu ngga dijual neng
en: oh, those are not for sale.

source: bunda belum selesai beres-beresnya
en: I have some more things to do.

source: tiba-tiba teringat masa lalu...?
en: ...suddenly reminded of my past?

source: oh, temen sekelas..
en: oh, my classmate.

source: ah ribet
en: I don’t think so.

source: lama-lama aku jadi bisa melihat apa yang ditangisi ibuku
en: eventually, I saw what my mother cried about.

source: i feel y-
en: I feel you--

source: ini saya pake! kyaahahaha
en: I’m wearing it! hahaha

source: katanya dia dateng buat minta dibukain iketannya
en: they believe it won’t stop coming unless we untie its shroud.

source: hai binaar
en: hi, binar!

source: ya ampun..
en: oh my god...

source: begitu ya?
en: Is that so?

source: itulah saat-saat terakhirku melihatnya
en: ...that was the last time I saw him.

source: kamu belum inget apapun?
en: have you remembered anything?

source: kenapa pergi tidak bilang padaku...
en: ...the reason you left without saying anything...

source: walau aku pergi?
en: ...even if I’m gone?

source: kamu halusinasi ya?
en: are you hallucinating?

source: Aku harap suatu saat kita bisa bertemu lagi Juni
en: I hope one day we could meet again, juni.

source: hah kok bisa?!
en: how is it possible?!

source: dia temanmu juga
en: he was also your friend.

source: hanya hatiku yang hancur
en: however, my heart was broken

source: hati-hati dong kalo jalan..
en: watch your step when you walk.

source: kalian tahu juga tentang masa laluku?
en: ...you guys knew all along?

source: sama
en: same here.

source: terus.. kok kamu inget apa kata doktermu?
en: then, how could you recall what your doctor said?

source: siapa sebenarnya damar?
en: who in the world is damar?

source: aku harus apa...
en: what should I do...

source: tapi belum liat wujudnya
en: but I haven’t seen one.

source: dia istriku!!
en: she’s my wife!

source: jangan kemana-mana..
en: ...that you won’t go anywhere...

source: hari ini beberapa hari setelah lebaran...
en: it was a few days after eid mubarak.

source: engga!
en: no!

source: lalu kamu temenku, jadi ya sudah
en: and you’re my friend, so there’s that.

source: foto gagal yg pertama
en: the first picture didin’t work out.

source: sampai kamu menemukan alasanmu hidup
en: just until you find a purpose for your life.

source: apa?!
en: what?!

source: AH IYA, MATAKU MINUS JADI HARUS SERING LIHAT...
en: I’m nearsighted, so i gotta look at distant objects to rest...

source: tidak!
en: oh nooo!

source: permisi!
en: excuse me!

source: terus kalau liat caranya main beberapa game...
en: looking at the way he played those games...

source: bukan karena ulah setan jembatan itu kan?
en: ...because of the ghost, did you?

source: haah bikin kaget aja
en: dang, it startled me.

source: sudah ah aku balik ke kelas
en: forget it, I’m going back to the classroom.

source: biarin, orang cantik bebas
en: let me be, I’m pretty

source: tapi mungkin aku tau siapa aku sekarang
en: but now, maybe I know who I am.

source: kenapa kamu bisa ngga ingat...
en: you’re the only one who knew...

source: trililit
en: riiing

source: aku sempat merasakan kehadirannya..
en: I did feel his presence.

source: oh dia pernah bikin lagu juga, tapi..
en: he also wrote a song, and...

source: maaf lahir batin ya
en: eid mubarak.

source: kalian mungkin ngga percaya..
en: maybe you won’t believe it.

source: iya gapapa!
en: nope, it’s alright!

source: iya? ada yang bisa dibantu?
en: yes, what can I help you with?

source: jreeng
en: strum

source: malamnya aku akan mengerjakan pr, atau sekedar nonton tv
en: at night, I’d either do my homework or watch TV.

source: jun...
en: juni...

source: oh gitu
en: I see.

source: aku bisa nggak ya?!
en: can i really do it?!

source: ogah!!
en: dun wanna!

source: gasabar!
en: I can’t wait to see it!

source: waalaikumsalam!
en: hi!

source: waah film baru ya?
en: are those new VCDs?

source: kamu lagi takut ya?
en: you’re scared now, aren’t you?

source: hm?
en: hmm?

source: SELESAI
en: fin

source: rumahku jadi berantakan dan heboh terus setiap hari
en: so my house became a mess and a noisy place every day.

source: haduh, tadi kan sudah saya ajarin
en: I’ve shown you how to do it, haven’t I?

source: karena sejauh itu pula kami membawa setan ini jalan-jalan
en: it's because a ghost was accompanying us on that lengthy journey.

source: janji ya?
en: you promise?

source: apa sekalian nanti waktu ke rumah sakit ?
en: how about after we go to the hospital?

source: kalau kamu tanya semua orang dewasa di sini juga pasti tahu
en: all the adults here knew about it.
